package array

import "testing"

/*
练习题，针对一维数组、二维数组、排序和查找知识点做总结。
*/
func TestArray05(t *testing.T){
	//1.随机生成10个整数(1~100)保存到数组，并倒序打印以及求平均值，求最大值和最大值下标，并查打里面是否有55.
	array51()
	//2.已知有个排序好(升序)的数组，要求插入一个元素，最后打印该数组，顺序依然是升序
	array52()
	//3.定义一个3行4列的二维数组，编写程序将四周的数据清0
	array53()
	//4.定义一个4行4列二维数组,然后将第1行和第4行数据进行交换,将第2行和第3行的数据进行交换
	//5.试保存1,3,5,7,9奇数到数组，并倒序打印
	//6.试写出查找的核心代码，如已知数组arr [10]string,里面保存了10个元素，现查找'AA'是否在其中，并打印其下标
	//7.随机生成10个整数(1~100)，使用冒泡排序法进行排序，然后使用二分查找法，查找是否有90这个数，并显示下标。
	//8.编写一个函数，可以接收一个数组，该数组有5个元素，请找出最大数和最小数及对应的数组下标。
	//9.定义一个数组，并给出8个整数,求该数组中大于平均值的数的个数及小于平均值的数的个数.
	/*
	10.跳水比赛,8个评委打分,运动员成绩是8个成绩去掉一个是高分，去掉一个最低分，剩下的6个分数的平均分即为最后得分。
	   使用一维数组实现如下功能：
	1).请把打最高分及最低分的评委找出来
	2).打出最佳评委(打分和最后得分最近)和最差秤委(打分和最后得分相关最大)。
	*/
}

func array51(){

}

func array52(){

}

func array53(){

}
